src/DataProcessors/ВызовВнешнихОбработок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>ВызовВнешнихОбработок</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВыборВнешнихОтчетов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/Enums/ВидыОбработок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыОбработок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПечатнаяФорма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешняяОбработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнийОтчет</Name>
					<Comment>Внешний отчет</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/DataProcessors/ВызовВнешнихОбработок/Forms/Форма/module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Обработчик события "ПриОткрытии".
//
Процедура ПриОткрытии()
	
	СписокВнешнихОбработок.Очистить();
	
	Если ВыборВнешнихОтчетов Тогда
		ЗаполнитьСписокОбработок(СписокВнешнихОбработок, Перечисления.ВидыОбработок.ВнешнийОтчет);
		Заголовок = "Внешние отчеты";
	Иначе
		ЗаполнитьСписокОбработок(СписокВнешнихОбработок, Перечисления.ВидыОбработок.ВнешняяОбработка);
		Заголовок = "Внешние обработки";
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ УПРАВЛЕНИЯ

// Обработчик события "ПриНажатии" кнопки Открыть.
//
Процедура ОсновныеДействияФормыОткрыть(Кнопка)
	
	Если СписокВнешнихОбработок.Количество() = 0 Тогда
		Сообщить("В списке нет ни одной внешней обработки.");
		Возврат;
	КонецЕсли;
	
	СтрокаСпискаЗначений = ЭлементыФормы.СписокВнешнихОбработок.ТекущаяСтрока;
	
	Если СтрокаСпискаЗначений = Неопределено Тогда
		Если ВыборВнешнихОтчетов Тогда
			Сообщить("Не выбран отчет");
		Иначе
			Сообщить("Не выбрана обработка");			
		КонецЕсли;
		
		Возврат;
	КонецЕсли;
	
	Попытка
		ВнешняяОбработка = ПолучитьОбработкуИзСправочникаВнешнихОбработок(СтрокаСпискаЗначений.Значение, ВыборВнешнихОтчетов);
		ВнешняяОбработка.ПолучитьФорму().Открыть();
	Исключение
		Если ВыборВнешнихОтчетов Тогда
			Сообщить("Ошибка открытия отчета!");
		Иначе
			Сообщить("Ошибка открытия обработки!");
		КонецЕсли;
		
	КонецПопытки;
	
КонецПроцедуры

// Обработчик события "Выбор" списка значений СписокВнешнихОбработок.
//
Процедура СписокВнешнихОбработокВыбор(Элемент, ЭлементСписка)
	
	Попытка
		ВнешняяОбработка = ПолучитьОбработкуИзСправочникаВнешнихОбработок(ЭлементСписка.Значение, ВыборВнешнихОтчетов);
		ВнешняяОбработка.ПолучитьФорму().Открыть();
	Исключение
		Если ВыборВнешнихОтчетов Тогда
			Сообщить("Ошибка открытия отчета!");
		Иначе
			Сообщить("Ошибка открытия обработки!");
		КонецЕсли;
	КонецПопытки;
	
КонецПроцедуры
